
--设置全局变量CC，保存游戏中使用的常数
function NewSetGlobalConst()
------------通用设置开始-----------
--难度控制----	0.81b调整难度
		--分别为各难度加强：我方攻、我方防、敌方攻、敌方防四项，范围为0.5至2之间，0.5为攻防减半，2为2倍攻防，数值超出将失效。
    CC.YXND={{1,1,1,1},
			{1,1,1.25,1.25},
			{1,1,1.5,1.5},
			{1,1,1.75,1.75},
			{1,1,2,2},
			}
	CC.YXNDXZ={'初窥门径','锋芒毕露','惊世骇俗','笑傲江湖','天人合一'}	--难度菜单项显示

--防卡屏开关设置--------
	CC.XTKG=1	--血槽开关
	CC.TXKG=1	--提醒开关
	CC.JZKG=1	--城市名称开关
	CC.SCKG=1	--小视窗开关
	CC.DEADKG=0	--败退显示开关

--开发版0.81b新增设置--
	CC.NAMEKG=1 --姓名显示开关

---武常总上限
	CC.WFWXSX=200	--我方武学上限总和
	CC.DFWXSX=200	--敌方武学上限总和

----对各版本BUG的强制修复，如果已对原剧本修复过了，不建议打开，否则可能产生冲突和错误----
	CC.BUGYB=0	--原版	0关闭 1开启
	CC.BUGCL=0	--苍龙
	CC.BUGZZ=0	--再战
	CC.BUGPTT=0	--乡民
	CC.BUGTSJ=0	--天书劫
	CC.BUG1028=0	--1028

	-- 自定义键盘设置，对应值为ASCII值
	VK_ESCAPE=27
	VK_Y=121
	VK_N=110
	VK_H=104
	VK_S=115
	VK_SPACE=32
	VK_RETURN=13
	VK_UP=1073741906
	VK_DOWN=1073741905
	VK_LEFT=1073741904
	VK_RIGHT=1073741903
------------------通用设置结束------------------


---------------------分割线------------------------


--------------天书劫3.0设置开始--------
	--动态显示提示
		CC.RUNSTR={
								'请尽可能多培养一些队友,不然武极殿你会吃大亏的',
								'设置文件名为“set.ini”  可以在里面更改主角姓名和一些常用的设置',
								'本作品为心血之作，严禁未经许可在此基础上二次改造出新作品',
								'凡是未经作者本人许可私自牟利销售的，一旦发生任何问题，均与本作者无关',
								'游戏里按S键为传送功能，H键为自动存档',
								'',
							};

------------------
   CC.MyStartPic=2501;      --主角走路起始贴图
   CC.BoatStartPic=3715;    --船起始贴图
    CC.BookNum=14;               --天书个数
    CC.BookStart=144;            --14天书起始物品id
    CC.MoneyID=174;              --金钱物品id
------------------
	CC.WXCS=50	--有效武学常识设置
	--升级时可增加属性的最低要求	0.82b增加
	CC.YXBQZ=10
	CC.DUDX=10
	CC.DXKTX=373
	CC.JSHead=373	--特殊角色头像编号	0.81b修正BUG
    CC.TeamWarNum=6;          --队伍可出战人数，最大6人
	CC.TSJSName="雷震"	--特殊角色名
	CC.YXBB="金庸群侠传之天书劫3.6-门派群英版"		--游戏版本
	CC.YXZZ="作者：木岛主"	--游戏版本作者
	CC.YXBD="2023.1.26   门派群英版1.71"	--版本号

			--公式设置	0.82b调整
			CC.SHGS=3	--是否使用复刻版公式	0原版	1苍龙	2复刻	3天书劫	0.81b新增
			CC.Level=60  --等级上限
			CC.Leave=100	--起始离线事件

		     --人物属性最大值，部份数值修改过大会报错，谨慎修改！
		   CC.PersonAttribMax["经验"]=30000;
		   CC.PersonAttribMax["物品修炼点数"]=30000;
		   CC.PersonAttribMax["修炼点数"]=30000;
		   CC.PersonAttribMax["生命最大值"]=2000;
		   CC.PersonAttribMax["受伤程度"]=100;
		   CC.PersonAttribMax["中毒程度"]=100;
		   CC.PersonAttribMax["内力最大值"]=9999;
		   CC.PersonAttribMax["体力"]=100;
		   CC.PersonAttribMax["攻击力"]=3000;
		   CC.PersonAttribMax["防御力"]=3000;
		   CC.PersonAttribMax["轻功"]=999;
		   CC.PersonAttribMax["医疗能力"]=500;
		   CC.PersonAttribMax["用毒能力"]=500;
		   CC.PersonAttribMax["解毒能力"]=500;
		   CC.PersonAttribMax["抗毒能力"]=100;
		   CC.PersonAttribMax["拳掌功夫"]=999;
		   CC.PersonAttribMax["御剑能力"]=999;
		   CC.PersonAttribMax["耍刀技巧"]=999;
		   CC.PersonAttribMax["特殊兵器"]=999;
		   CC.PersonAttribMax["暗器技巧"]=999;
		   CC.PersonAttribMax["武学常识"]=200;
		   CC.PersonAttribMax["品德"]=100;
		   CC.PersonAttribMax["资质"]=100;
		   CC.PersonAttribMax["攻击带毒"]=100;

			CC.NewGameSceneID=70;                      --场景ID
			CC.NewGameSceneX=16;                       --场景坐标
			CC.NewGameSceneY=31;
			CC.NewGameEvent=2079;                       --新游戏场景执行事件。如果没有，则执行新游戏坐标路过事件。
			CC.NewPersonPic=2515;                      --开始主角pic
			CC.SwapEvent=1712;	--跳过开始动画事件		0.81b新增

			CC.SceneNameRen=1	--新游戏场景是否改名
			CC.SceneName="小村"
			CC.LoadThingPic=0              --读取物品贴图方式 0 从mmap/smap/wmap中读取  1 读取独立的thing.idx/grp
			CC.StartThingPic=4131          --物品贴图在mmap/smap/wmap中的起始编号。CC.LoadThingPic=0有效
			CC.Shemale={ [99]=1,[315]=1,[401]=0}   --需要自宫的书的id

----攻略相关，任务完成功能--------
		CC.RWGN=0	--是否开启任务提示	0.81b新增
		CC.GLTS[0]={1,1150,1151,1151,1160,1158,1151,1155,2018};	--飞狐外传
		CC.GLTS[1]={1143,3,5,8,10,11,12,1154,13,15,1146,1665,18,1152,17,32,33,1153,1665,18};  --雪山飞狐
		CC.GLTS[2]={39,39,38,41,1163,45,1161,49,39,38,41,42,45,1328,1666,49,1810,2021};  --连城诀
		CC.GLTS[3]={575,553,583,1394,1396,1067,521,523,1669,525,547,556,565,566,567,1414,1416,1723,573,1412,1398,1061,1400,1402,1403,1419,714,1483,585,586,1418,1071,589,1419,594,1333,1405,1727,598,1407,600,1408,634,1420,610,630,1425,2011,2013,1985,2024,2025};  --天龙八部
		CC.GLTS[4]={456,449,513,515,1695,458,462,466,1684,1431,1427,467,468,496,1681,1486,497,501,1692,516,502,1725,1724,1672,496,1681,512,497,1047,483,1050,508,2016,2022};  --射雕英雄传
		CC.GLTS[5]={1165,52,52,1167,53,1696,55,52,53,55,2017}; --白马啸西风
		CC.GLTS[6]={62,86,1736,1169,1172,1741,2034,2037,1177,1196,1199,89,1201,1174,63,88,56,94,1198,95,1203,2009,2026,2020,2015,1659};  --鹿鼎记
		CC.GLTS[7]={740,744,745,871,762,925,749,754,755,759,828,760,772,1998,1999,777,2000,783,794,804,2001,2002,2003,2004,887,911,1483,1053,1054,1331,1484,1998,919,915,1726,730,916,2014}; --笑傲江湖
		CC.GLTS[8]={1203,1119,1126,1128,1658,1205,1206,1212,1214,1219,1220,1224,1118,1127,1129,1215,1216,1218,1488,1985}; --书剑恩仇录
		CC.GLTS[9]={842,725,1429,1439,926,1458,1103,1442,1109,1444,1457,1113,1113,1117,1100,1446,1447,1432,1448,1113,1698,1690,1449,1450,1451,1452,1455,1454,2010,1828}; --神雕侠侣
		CC.GLTS[10]={372,375,379,382,385,392,1239,416,1236,421,420,422,423,425,428}; --侠客行
		CC.GLTS[11]={1226,313,1633,1634,1635,1637,1644,1646,1697,279,280,1653,305,1463,1474,315,1334,281,284,285,1062,1633,1635,305,309,291,293,1477,297,298,299,300,304,1045,302,1478,1479,2010,2015,2023,2080}; --倚天屠龙记
		CC.GLTS[12]={316,321,1250,323,325,326,1689,344,346,1660,1252,351,353,927,354,1243,357,358,360,1990}; --碧血剑
		CC.GLTS[13]={1086,1687,1088,1260,1262,1256,1259,1263,2012};	--鸳鸯刀

-------角色属性相关设置-------

--普通角色升级增加	0.81b作出调整
			CC.ZZADD={3,3,3,4,5,6,7}	--资质对攻、防影响，资质由低到高
			CC.QGADD={2,2,2,2,2,3,3} --升级时增加的轻功属性
			CC.UPADD={2,2,2,2,2,2,2,2}	--升级时增加的其他8项属性，随机属性

--特殊角色升级增加
			CC.TSZZADD={3,3,3,4,5,6,7}	--资质对攻、防影响，资质由低到高
			CC.TSQGADD={2,2,2,2,2,3,3}	--升级时增加的轻功属性
			CC.TSUPADD={2,2,2,2,2,2,2,2}	--升级时增加的其他8项属性，固定属性


    --特殊角色属性定义
    CC.TSJSSX["生命增长"]=3
    CC.TSJSSX["外号"]="天命之子"
    CC.TSJSSX["生命"]=30
    CC.TSJSSX["生命最大值"]=30
    CC.TSJSSX["内力性质"]=2
    CC.TSJSSX["内力"]=30
    CC.TSJSSX["内力最大值"]=30
    CC.TSJSSX["攻击力"]=30
    CC.TSJSSX["轻功"]=30
    CC.TSJSSX["防御力"]=30
    CC.TSJSSX["医疗能力"]=30
    CC.TSJSSX["用毒能力"]=30
    CC.TSJSSX["解毒能力"]=30
    CC.TSJSSX["拳掌功夫"]=30
    CC.TSJSSX["御剑能力"]=30
    CC.TSJSSX["耍刀技巧"]=30
    CC.TSJSSX["特殊兵器"]=30
    CC.TSJSSX["暗器技巧"]=30
    CC.TSJSSX["抗毒能力"]=30

	CC.HanhuaKG=1;	--喊话开关，是否在场景显示	0关闭	1显示	0.83b新增
--场景喊话功能：场景编号，X坐标，Y坐标，喊话内容1 ，喊话内容2
--因为做了防顿卡处理，场景编号必须从小到大按顺序排列，否则会出现不能显示的情况
	CC.Hanhua={
                                                          {11,31,48,"本教招收新弟子","明教拜师处"},
				{18,41,29,"本派招收新弟子","古墓派拜师处"},
				{19,16,44,"本派招收新弟子","全真剑派拜师处"},
                                                          {20,40,32,"本派招收新弟子","全真拳派拜师处"},
                                                          {22,20,44,"本派招收新弟子","绝情谷拜师处"},
				{26,54,28,"本教招收新弟子","日月神教拜师处"},
				{27,52,31,"本派招收新弟子","五岳联盟拜师处"},
				{28,33,26,"本寺招收新弟子","少林寺拜师处"},
                                                          {33,27,39,"本派招收新弟子","峨眉派拜师处"},
                                                          {34,47,26,"本派招收新弟子","崆峒派拜师处"},
				{35,15,38,"本派招收新弟子","星宿派拜师处"},
				{36,28,25,"本派招收新弟子","青城派拜师处"},
				{40,33,28,"本门招收新弟子","刀门拜师处"},
				{43,46,16,"本派招收新弟子","武当派拜师处"},
				{51,46,28,"本帮招收新弟子","丐帮拜师处"},
                                                          {52,46,14,"本门招收新弟子","慕容家拜师处"},
				{53,16,28,"本派招收新弟子","逍遥派拜师处"},
				{57,48,34,"本派招收新弟子","华山剑派拜师处"},
                                                          {60,36,27,"本派招收新弟子","密宗拜师处"},
                                                          {68,49,29,"本派招收新弟子","昆仑派拜师处"},
				{70,18,41,"出售食材","出售食材"},
				{70,22,41,"出售药材","出售药材"},
				{75,24,43,"本派招收新弟子","桃花岛拜师处"},
                                {80,27,29,"本派招收新弟子","华山拳派拜师处"},
                                                          {80,7,16,"本门招收新弟子","铁剑门拜师处"},
                                                          {96,23,28,"本教招收新弟子","五仙教拜师处"},
				{112,10,45,"本派招收新弟子","段家拜师处"},
                                                          {127,46,37,"本派招收新弟子","江南梅家拜师处"},
                                                          {140,25,24,"本派招收新弟子","白驼山派拜师处"},
				{144,28,14,"本门招收新弟子","七青门拜师处"},
                                                          {145,27,25,"本寺招收新弟子","清凉寺拜师处"},
                                                          {146,32,23,"本派招收新弟子","华山刀派拜师处"},
                                                          {147,33,26,"本寺招收新弟子","南少林寺拜师处"},
                                                          {148,29,15,"本门招收新弟子","西域金刚门拜师处"},
                                                          {156,10,49,"10000下注区","10000下注区"},
                                                          {156,13,53,"5000下注区","5000下注区"},
                                                          {156,19,49,"1000下注区","1000下注区"},
					}
	CC.MSKG=1	--模式开关，0经典  1自由，0.84b新增，自由模式需要高难度开启
	CC.TSJZS=1	--天书劫开局助手，搜括各处物品	0关闭	1开启

end
